do local rect =
    {
        {id=1,msg="今日守擂—"},
        {id=2,msg="下期守擂—"},
        {id=3,msg="上期守擂—"},
        {id=4,msg="击杀奖励"},
        {id=5,msg="今日剩余免费挑战次数："},
        {id=6,msg="挑战"},
        {id=7,msg="钻石数量不足"},
        {id=8,msg="活动规则"},
        {id=9,msg="活动时间：%s至%s\n1、挑战次数消耗规则：擂台双方任意一方被击败，战斗都会结束。将消耗一次挑战次数。\n2、每天最少可以<color=#FF1919>免费挑战1次</color>，消耗宝石后可以获得额外的挑战次数，每个守擂英雄最多能够额外挑战<color=#FF1919>20次，VIP玩家会根据VIP等级附赠免费挑战次数。</color>\n3、攻擂的勇士只有在打倒守擂英雄时才会获得碎片奖励，如果勇士被守擂英雄击败，则视为挑战失败不能获得碎片奖励，并且消耗战斗次数。第二次挑战时，英雄的血量和等级会保持在上一次擂台战斗结束的状态。如果勇士击败守擂英雄，那么挑战时守擂英雄的等级难度会提升。\n4、守擂英雄一共会有10个等级，如果勇士将所有等级的英雄都击败后，则视为挑战完成，挑战次数会在当天24时刷新。"},
        {id=10,msg="活动时间：%s至%s"},
        {id=11,msg="剩余挑战时间：%s：%s：%s"},
        {id=12,msg="规则说明"},
        {id=13,msg="剩余挑战次数不足,无法挑战!"},
        {id=14,msg="提示!"},
        {id=15,msg="当前钻石不足,是否前往充值?"},
        {id=16,msg="是否消耗<color=#ff1919>%s</color>钻石进行挑战?"},
        {id=17,msg="已过期"},
        {id=18,msg="未开始"},
        {id=19,msg="无法挑战该关卡"},
        {id=20,msg="当前关卡已通关!"},
        {id=21,msg="已通关"},
        {id=22,msg="今日剩余挑战次数："}
    }
    return rect end