do local rect =
    {
        {id=1,msg="活动规则"},
        {id=2,msg="活动时间：%s年%s月%s日%s：%s点至%s：%s分\n活动规则：\n1.欢乐周末礼包需要活跃度达到%s才能购买。活跃度通过日常任务的完成来获得。\n2.能量补充系列礼包不要任何条件购买。\n3.每个礼包限购一次。\n4.此活动界面的礼包购买，参与累计充值、首次充值、神秘丽塔活动骰子累计、灵界之主艾斯活动邀请函领取"},
        {id=3,msg="欢乐周末礼包"},
        {id=4,msg="能量补充礼包Ⅰ型"},
        {id=5,msg="能量补充礼包Ⅱ型"},
        {id=6,msg="能量补充礼包Ⅲ型"},
        {id=7,msg="购买"},
        {id=8,msg="限量购买"},
        {id=9,msg="%s次"},
        {id=10,msg="活跃度需达到%s"},
        {id=11,msg="活动时间：###"},
        {id=12,msg="活跃度不足，请殿下先完成日常任务哦"},
        {id=13,msg="规则说明"},
        {id=14,msg="%s年%s月%s日-%s年%s月%s日"},
        {id=15,msg="服务器区号异常，请重新登录"},
        {id=16,msg=" 确定购买吗?"},
        {id=17,msg="宝石不足，请前往充值"},

       
    }
    return rect end