do local ret=
    {
        {id=1,msg="1.玩家在活动期间获得的多少宝石，则会另外存入保险箱多少宝石."},
        {id=2,msg="2.当玩家收集到500/1130/3000的宝石后，则可以通过6.6折的折扣分别购买到500/1130/3000宝石"},
        {id=3,msg="3.该活动每周重置一次"},
        {id=4,msg="宝石数量统计范围"},
        {id=5,msg="1.充值，日常，成就，任务以及各类活动中获得的宝石数量都会被统计在内"},
        {id=6,msg="殿下收集<size=27><color=#FFDB00>%s宝石</color></size>之后，可以花费<size=27><color=#FFDB00>¥%s</color></size>购买"},
        {id=7,msg="已购买"},
        {id=8,msg="¥%s购买"},
        {id=9,msg="该活动参与首次充值和累计充值"},
    }
return ret end