do local rect =
{
    {id=1227001,msg="火力压制"},
    {id=1227002,msg="疯狂\n科技"},
    {id=1227003,msg="对全屏的敌人发射5枚随机散布的炮弹，每一发造成团队技能的英雄攻击力之和*80%的范围物理伤害。并使命中的敌人眩晕3秒。"},
    {id=1227004,msg="对全屏的敌人发射5枚随机散布的炮弹，每一发造成团队技能的英雄攻击力之和*100%的范围物理伤害。并使命中的敌人眩晕3秒。"},
    {id=1227005,msg="对全屏的敌人发射6枚随机散布的炮弹，每一发造成团队技能的英雄攻击力之和*120%的范围物理伤害。并使命中的敌人眩晕3秒。"},
    {id=1227006,msg="在指定的范围内落下一颗酸性炸弹，生成持续3秒的酸性毒雾，对经过的敌人附加一层酸性腐蚀伤害，使其每秒受到团队技能的英雄攻击力之和*20%的魔法伤害，持续5秒。期间受到的伤害会提高20%。"},
    {id=1227007,msg="在指定的范围内落下一颗酸性炸弹，生成持续3秒的酸性毒雾，对经过的敌人附加一层酸性腐蚀伤害，使其每秒受到团队技能的英雄攻击力之和*25%的魔法伤害，持续7秒。期间受到的伤害会提高20%。"},
    {id=1227008,msg="在指定的范围内落下一颗酸性炸弹，生成持续3秒的酸性毒雾，对经过的敌人附加一层酸性腐蚀伤害，使其每秒受到团队技能的英雄攻击力之和*30%的魔法伤害，持续9秒。期间受到的伤害会提高20%。"}
}
return rect end